
# FORMATTING TAMPILAN SUATU DATA FRAME ###

## Import Modules ##

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

### Persiapan Data Frame ##

In [2]:
n_rows = 5
n_cols = 2
cols = ['omset', 'operasional']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                 columns=cols)
df

   omset  operasional
0     19            8
1      2           15
2     14            8
3      9           19
4     10           11

In [4]:
#untuk mengubah satuan menjadi rupiah
df['omset'] = df['omset'] * 100_000 
df['operasional'] = df['operasional'] * 10_000
df

        omset  operasional
0  1021438976        80000
1 -1474836480       150000
2 -1733920768        80000
3  -194313216       190000
4  1215752192       110000

In [5]:
# modifikasi lebih lanjut mementuk kolom baru yaitu kolom tanggal
df.index = pd.util.testing.makeDateIndex(n_rows, freq='D') #untuk menjadikan index saat ini menjadi sebuah kolom biasa
df = df.reset_index()
df = df.rename(columns={'index':'tanggal'})
df

C:\Users\Velin\anaconda3\lib\site-packages\pandas\util\__init__.py:15: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing

     tanggal       omset  operasional
0 2000-01-01  1021438976        80000
1 2000-01-02 -1474836480       150000
2 2000-01-03 -1733920768        80000
3 2000-01-04  -194313216       190000
4 2000-01-05  1215752192       110000

### Melakukan Formatting Tampilan Data Frame ##

In [6]:
formatku = {'tanggal': '{:%d/%m/%y}',
           'operasional':'Rp {:.2f}',
           'omset':'Rp {:.2f}'}

laporan = df.style.format(formatku)
laporan #objek yang di simpan di laporan bukan tipe data frame

In [11]:
type(laporan)

pandas.io.formats.style.Styler

In [8]:
laporan.hide_index() #untuk menyembunyikan index

In [16]:
laporan.set_caption('Data Omset dan Operasional') #untuk memberikan judul

In [15]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operasional', color='lightblue')
laporan.highlight_max('operasional', color='grey')

2173004_Velinda Novelia Candra